#+title: Day1
#+property: header-args

** code
#+name: pth1.c
#+begin_src C :tangle pth1.c
#include<stdio.h>
#include<pthread.h>

void *hello(){
    printf("Hello World\n");
}

int main(){
    pthread_t t;
    pthread_create(&t, NULL, hello, NULL);
    pthread_join(t, NULL);
    return 0;
}
#+end_src

#+RESULTS: pth1.c
: Hello World

** run
#+name: run pth1.c
#+begin_src bash :results output :exports both
./pth1.out
#+end_src

#+RESULTS: run pth1.c
: Hello World

** code
#+name: pth2.c
#+begin_src C :tangle pth2.c :results output
#include<stdio.h>
#include<stdlib.h>
#include<pthread.h>
#define N 2
void *hello(void* threadId){
    long tid = (long)threadId;
    printf("Hello World %ld of %d\n", tid, N);
    return NULL;
}
int main(){
    pthread_t t1, t2;

    pthread_create(&t1, NULL, hello, (void*) 0);
    pthread_join(t1, NULL);
    pthread_create(&t2, NULL, hello, (void*) 1);
    pthread_join(t2, NULL);
    return 0;
}
#+end_src

#+RESULTS: pth2.c
: Hello World 0 of 2
: Hello World 1 of 2

** run
#+name: run pth2.c
#+begin_src bash :results output :exports both
file=pth2
./$file.out

#+end_src

#+RESULTS: run pth2.c
: Hello World 0 of 2
: Hello World 1 of 2

** run
#+name: run pth3.c
#+begin_src bash :results output :exports both
file=pth3
./$file.out
#+end_src

#+RESULTS: run pth3.c
#+begin_example
Hello World 0 of 10
Hello World 1 of 10
Hello World 2 of 10
Hello World 3 of 10
Hello World 4 of 10
Hello World 5 of 10
Hello World 6 of 10
Hello World 7 of 10
Hello World 8 of 10
Hello World 9 of 10
#+end_example

* Solution task1
#+name: task1.c
#+begin_src C :tangle task1.c :results output :exports both
#include<stdio.h>
#include<stdlib.h>
#include<unistd.h>
#include<pthread.h>
#define N 16
int arr[N];
void* hello(void* threadId){
    long tid = (long)threadId;
    printf("Thread id %ld is printing %d\n", tid, arr[tid]);
    return NULL;
}
int main(){
    pthread_t t[N];
    for(int i = 0; i < N; i++){
        arr[i] = i;
    }
    for(long i = 0; i < N; i++){
        pthread_create(&t[i], NULL, hello, (void*) i);
    }
    for(long i = 0; i < N; i++){
        pthread_join(t[i], NULL);
    }
    return 0;
}
#+end_src

#+RESULTS: task1.c
#+begin_example
Thread id 0 is printing 0
Thread id 2 is printing 2
Thread id 3 is printing 3
Thread id 4 is printing 4
Thread id 5 is printing 5
Thread id 1 is printing 1
Thread id 6 is printing 6
Thread id 7 is printing 7
Thread id 8 is printing 8
Thread id 9 is printing 9
Thread id 10 is printing 10
Thread id 11 is printing 11
Thread id 12 is printing 12
Thread id 13 is printing 13
Thread id 14 is printing 14
Thread id 15 is printing 15
#+end_example

* test2
#+name: test2.c
#+begin_src C :results output :exports both :tangle test2.c
#include<stdio.h>
#include<stdlib.h>
#include<unistd.h>
#include<pthread.h>
#define N 16
void* hello(void* threadId){
    long tid = (long)threadId;
    printf("Forking %ld of %d\n", tid, N);
    sleep(1);
    printf("Joining %ld of %d\n", tid, N);
    return NULL;
}
int main(){
    pthread_t t[N];

    for(long i = 0; i < N; i++){
        pthread_create(&t[i], NULL, hello, (void*) i);
    }
    for(long i = 0; i < N; i++){
        pthread_join(t[i], NULL);
    }
    return 0;
}
#+end_src

#+RESULTS: test2.c
#+begin_example
Forking 0 of 16
Forking 1 of 16
Forking 3 of 16
Forking 2 of 16
Forking 4 of 16
Forking 5 of 16
Forking 6 of 16
Forking 7 of 16
Forking 8 of 16
Forking 9 of 16
Forking 10 of 16
Forking 11 of 16
Forking 12 of 16
Forking 13 of 16
Forking 14 of 16
Forking 15 of 16
Joining 1 of 16
Joining 0 of 16
Joining 2 of 16
Joining 3 of 16
Joining 4 of 16
Joining 5 of 16
Joining 6 of 16
Joining 8 of 16
Joining 7 of 16
Joining 9 of 16
Joining 10 of 16
Joining 11 of 16
Joining 12 of 16
Joining 13 of 16
Joining 14 of 16
Joining 15 of 16
#+end_example
